RzgTech/STM32f4xx-Drivers/Src/012i2c_slave_tx_string.c
/*
 * 009i2c_master_tx_testing.c
 *
 *  Created on: 8 Mar 2026
 *      Author: Vahid
 */

#include<string.h>
#include<stdio.h>
#include "stm32f407xx.h"

#define SLAVE_ADDR	   0x68
#define MY_ADDR		   SLAVE_ADDR

void delay(void)
{
	for(uint32_t i = 0 ; i < 500000 ; i ++);
}

I2C_Handle_t I2C1Handle;

//tx buffer
uint8_t tx_buf[32] = "STM32 slave mode testing.";

/*
 * PB6-> SCL
 * PB9-> SDA
 */

void I2C1_GPIOInits()
{
	GPIO_Handle_t I2CPins;
	I2CPins.pGPIOx = GPIOB;
	I2CPins.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	I2CPins.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_OD;
	I2CPins.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_PU;
	I2CPins.GPIO_PinConfig.GPIO_PinAltFunMode = 4; //based on Alt func table
	I2CPins.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;

	//SCL
	I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_6;
	GPIO_Init(&I2CPins);

	//SDA
	I2CPins.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_9;
	GPIO_Init(&I2CPins);

}

void I2C1_Inits(void)
{
	I2C1Handle.pI2Cx = I2C1;
	I2C1Handle.I2C_Config.I2C_ACKControl = I2C_ACK_ENABLE;
	I2C1Handle.I2C_Config.I2C_DeviceAddress = MY_ADDR;  //sth random -> you cannot use reserved addresses (refer to sepc. UM10204)
														//here we are master and the address does not matter. we usuallu assign address to the slave

	I2C1Handle.I2C_Config.I2C_FMDutyCycle = I2C_FM_DUTY_2;
	I2C1Handle.I2C_Config.I2C_SCLSpeed = I2C_SCLSpeed_SM;

	I2C_Init(&I2C1Handle);

}

void GPIO_BtnInit()
{

	GPIO_Handle_t GpioBtn;
	//this is button gpio configuration
	GpioBtn.pGPIOx = GPIOA;
	GpioBtn.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_0;
	GpioBtn.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
	GpioBtn.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GpioBtn.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	GPIO_Init(&GpioBtn);
}


int main(void)
{

	GPIO_BtnInit();
	//I2C pin inits
	I2C1_GPIOInits();

	//I2C peripheral configurations
	I2C1_Inits();

	//I2C IRQ configurations
	I2C_IRQInterruptConfig(IRQ_NO_I2C1_EV, ENABLE);
	I2C_IRQInterruptConfig(IRQ_NO_I2C1_ER, ENABLE);

	I2C_SlaveEnableDisableCallbackEvents(I2C1, ENABLE);

	//enable the i2c peripheral
	I2C_PeripheralControl(I2C1, ENABLE);

	//ack bit is made 1 after PE = 1
	I2C_ManageAcking(I2C1, ENABLE);


	while(1);

}


void I2C1_EV_IRQHandler(void)
{
	I2C_EV_IRQHandling(&I2C1Handle);
}

void I2C1_ER_IRQHandler(void)
{
	I2C_ER_IRQHandling(&I2C1Handle);
}


void I2C_ApplicationEventCallback(I2C_Handle_t *pI2CHandle,uint8_t AppEv)
{
	static uint8_t commandCode;
	static uint8_t cnt = 0;

	if (AppEv == I2C_EV_DATA_REQ)
	{
		//master wants some data. Slave has to send it
		if (commandCode == 0x51)
		{
			//send the length information to the master
			I2C_SlaveSendData(pI2CHandle->pI2Cx, strlen((char*)tx_buf));

		}else if (commandCode == 0x52)
		{
			//send the contents of tx_buf
			I2C_SlaveSendData(pI2CHandle->pI2Cx, tx_buf[cnt++]);
		}

	}else if (AppEv == I2C_EV_DATA_RCV)
	{
		//Data is waiting for the slave to read. Slave has to read it
		commandCode = I2C_SlaveReceiveData(pI2CHandle->pI2Cx);

	}else if (AppEv == I2C_ERROR_AF)
	{
		//this happens only during Slave txing...
		//master has sent NACK. So, slave should understand that master doesnt need more data
		commandCode = 0xff;
		cnt = 0;

	}else if (AppEv == I2C_EV_STOP)
	{
		//This happens only during slave reception
		//Master has ended the I2C communication with the slave.
	}

}
